Here is the output of the `terraform apply` using the resource you've provided.

```bash
$terraform providers

Providers required by configuration:
.
└── provider[registry.terraform.io/oktadeveloper/okta] ~> 3.6

Providers required by state:

    provider[registry.terraform.io/oktadeveloper/okta]

$ terraform show

$ terra terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # okta_app_oauth.cloudflare_access will be created
  + resource "okta_app_oauth" "cloudflare_access" {
      + auto_key_rotation          = true
      + auto_submit_toolbar        = false
      + client_id                  = (known after apply)
      + client_secret              = (sensitive value)
      + consent_method             = "TRUSTED"
      + grant_types                = [
          + "authorization_code",
        ]
      + hide_ios                   = true
      + hide_web                   = true
      + id                         = (known after apply)
      + issuer_mode                = "ORG_URL"
      + label                      = "CloudFlare Access"
      + name                       = (known after apply)
      + omit_secret                = false
      + redirect_uris              = [
          + "https://example.com",
        ]
      + response_types             = [
          + "code",
        ]
      + sign_on_mode               = (known after apply)
      + status                     = "ACTIVE"
      + token_endpoint_auth_method = "client_secret_basic"
      + type                       = "web"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

okta_app_oauth.cloudflare_access: Creating...
okta_app_oauth.cloudflare_access: Creation complete after 5s [id=0oausrq33av8owoxF0h7]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
$ terraform apply
okta_app_oauth.cloudflare_access: Refreshing state... [id=0oausrq33av8owoxF0h7]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
$ terraform show 
# okta_app_oauth.cloudflare_access:
resource "okta_app_oauth" "cloudflare_access" {
    auto_key_rotation          = true
    auto_submit_toolbar        = false
    client_id                  = "0oausrq33av8owoxF0h7"
    client_secret              = (sensitive value)
    consent_method             = "TRUSTED"
    grant_types                = [
        "authorization_code",
    ]
    hide_ios                   = true
    hide_web                   = true
    id                         = "0oausrq33av8owoxF0h7"
    issuer_mode                = "ORG_URL"
    label                      = "CloudFlare Access"
    name                       = "oidc_client"
    omit_secret                = false
    post_logout_redirect_uris  = []
    redirect_uris              = [
        "https://example.com",
    ]
    response_types             = [
        "code",
    ]
    sign_on_mode               = "OPENID_CONNECT"
    status                     = "ACTIVE"
    token_endpoint_auth_method = "client_secret_basic"
    type                       = "web"
}
```
